START_MESSAGE = """
**היי [{}](tg://user?id={}), ברוכים הבאים לרובוט הפקודות.**

אתה מנהל ברובוט.

שלח `/עזרה` לעוד אפשרויות.

הרובוט נוצר ע"י [מקליד תמיד](t.me/m100achuz). להצטרפות לערוץ הרובוטים שלי [לחצו כאן](https://t.me/M100achuzBots).
"""
HELP = """
היי 👋 שמח שבחרתם להשתמש ברובוט שלי.

זהו תפריט שילמד אתכם להוציא מהרובוט את הטוב ביותר.
הפקודות שאתם אמורים להכיר הם:
/ניהול - כניסה לתפריט הניהול.
/סגור תפריט ניהול - יציאה מתפריט הניהול.
/עזרה - פתיחת תפריט זה.
/סטטוס - הפקודה תעזור לכם לדעת האם אתם נמצאים כרגע בתפריט ניהול או בתפריט משתמש.
/משתמשים - רשימת המשתמשים שיצרו שיחה עם הרובוט עם קישור לשיחה איתם.

לחצו על הכפתורים מתחת כדי לקבל מידע נוסף.
לכל בעיה או בקשה - אשמח לשמוע אתכם [כאן](tg://user?id=789248230).
"""
HELP_COMMANSD = '''
**הוספת פקודות:**

תוכלו להוסיף פקודות על ידי כניסה לתפריט ניהול, ובחירה ב`הוספת פקודה`.
פורמט הוספת הפקודה הוא:
`שם הפקודה`
 `תגובה`
שם הפקודה = הטקסט אותו המשתמש ישלח לרובוט כדי לקבל את התגובה.
תגובה = הטקסט אותו הרובוט ישלח למשתמש בתגובה על הפקודה.

טקסט התגובה תומך Markdown, כלומר שתוכלו לעצב את הטקסט בקלות רבה על ידי שימוש בסימנים המוגדרים מראש.
תוכלו לקרוא את ההסבר המפורט [כאן](http://t.me/{}?start=md).
'''
MARKDOWN = """
אם הגעתם לכאן כנראה שאתם מעוניינים לשלוח הודעה מעוצבת בפורמט [Markdown](https://en.wikipedia.org/wiki/Markdown).

השימוש בMarkdown (או בקיצור - md) יעיל ופשוט הרבה יותר מHTML, למשתמש הרגיל.

קישור מוטמע: [טקסט](קישור)
תיוג משתמש (עובד גם בלי יוזרניים): [טקסט](tg://user?id=000000)
החליפו את הספרות 000000 בID של המשתמש.

מודגש: `**טקסט**`
נטוי: `__טקסט__`
קו חצוי: `~~טקסט~~`
מונו: ``טקסט``
"""
START_USER = """
היי [{}](tg://user?id={}), ברוכים הבאים [לרובוט הפקודות.](t.me/{})

הרובוט נוצר ע"י [מקליד תמיד](t.me/m100achuz). להצטרפות לערוץ הרובוטים שלי [לחצו כאן](https://t.me/M100achuzBots).
"""
